校招面试题目、
一，html篇。
二，css篇。
三，js篇
1.说说你对闭包的理解

使用闭包主要是为了设计私有的方法和变量。闭包的优点是可以避免全局变量的污染，缺点是闭包会常驻内存，会增大内存使用量，使用不当很容易造成内存泄露。

闭包有三个特性:

1.函数嵌套函数 
2.函数内部可以引用外部的参数和变量 
3.参数和变量不会被垃圾回收机制回收

1.什么是seo？
2.什么是标签语义化？
3.html5有哪些新的标签？
4.html5有哪些新的方法？
5.css的盒子模型？（box-sizing）
6.css的选择器优先级。
7.css的各种居中方案。
8.css如何清除浮动。
9.css如何实现左边定宽，右边自适应的布局。
10.css如何实现左右定宽，中间自适应的布局。
11.position有多少个属性，absolute和fixed和relative分别是怎样的？
12.什么是块元素什么是行内元素？
13.css伪元素？
14.css3有哪些新特性？
15.什么是事件委托？
16.什么是JavaScript的作用域，原型和原型链？
17.解释GET/POST的区别？
18.描述一下cookies，sessionStorage和localStorage的区别？
19.什么是闭包？
20.什么是ajax？
21.new 操作符到底做了什么？
22.函数内部的this对象？
23.JavaScript变量提升，函数声明提升？
24.JavaScript中有哪几种数据类型
25.项目中曾遇到哪些技术问题，你的解决思路？
26.你原来做过哪些让你印象深刻的项目？
27.你的职业规划？